#!/usr/bin/perl

=cut
1. Задан массив двухмерных координат(20 штук, уникальные, поле 20х20). В виде ("1:3","2:1","15:20") - представь себе как точки на тетради в клеточку. Х и У: "1:3" - первый столбец, третий ряд.
2. Пользователь с клавиатуры вводит свои координаты. Нужно найти ближайшие координаты либо полное совпадение, либо все координаты, которые окажутся ближайшими.
2.1 Вынести алгоритм определения ближайших координат в функцию и назвать его соответственно математическому алгоритму, который будет применяться.
=cut
