#/usr/bin/perl

=cut
1. Список чисел с клавиатуры или из массива (двадцать штук в переделах сотни)
2. Пользователь вводит число и получает максимально близкое число к указанному.
	2.1 Если такое число уже есть - получает имеющееся число
	2.2 Если есть два числа одинаково близкие, то выбирается то, которое больше
3. Указывается, что пустая строка - это завершение программы, программа работает до тех пор, пока пользователь вводит числа
4. Если пользователь ввел не число и не пустую строку, сообщить ему об ошибке и возобновить работу
=cut
