#!/usr/bin/perl -w
use strict;
#-------------------------------------------------- Нужная инфа для проги ------------------------------
my @lyrics = (
    "Народився Бог на санях
    в лемківськім містечку Дуклі.
    Прийшли лемки у крисанях
    і принесли місяць круглий.
    Ніч у сніговій завії
    крутиться довкола стріх.
    У долоні у Марії
    місяць — золотий горіх.",
    "Любіть Україну, як сонце, любіть,
    як вітер, і трави, і води…
    В годину щасливу і в радості мить,
    любіть у годину негоди.

    Любіть Україну у сні й наяву,
    вишневу свою Україну,
    красу її, вічно живу і нову,
    і мову її солов'їну.

    Між братніх народів, мов садом рясним,
    сіяє вона над віками…
    Любіть Україну всім серцем своїм
    і всіми своїми ділами.

    Для нас вона в світі єдина, одна
    в просторів солодкому чарі…
    Вона у зірках, і у вербах вона,
    і в кожному серця ударі,

    у квітці, в пташині, в електровогнях,
    у пісні у кожній, у думі,
    в дитячий усмішці, в дівочих очах
    і в стягів багряному шумі…

    Як та купина, що горить — не згора,
    живе у стежках, у дібровах,
    у зойках гудків, і у хвилях Дніпра,
    і в хмарах отих пурпурових,

    в грому канонад, що розвіяли в прах
    чужинців в зелених мундирах,
    в багнетах, що в тьмі пробивали нам шлях
    до весен і світлих, і щирих.

    Юначе! Хай буде для неї твій сміх,
    і сльози, і все до загину…
    Не можна любити народів других,
    коли ти не любиш Вкраїну!..

    Дівчино! Як небо її голубе,
    люби її кожну хвилину.
    Коханий любить не захоче тебе,
    коли ти не любиш Вкраїну…

    Любіть у труді, у коханні, у бою,
    як пісню, що лине зорею…
    Всім серцем любіть Україну свою —
    і вічні ми будемо з нею! ",
    "Молюсь  i  вiрю.  Вiтер  грає
    I  п'яно  вiє  навкруги,
    I  голубiв  тремтячi  зграï
    Черкають  неба  береги.

    I  ти  смiєшся,  й  даль  яснiє,
    I  серце  б'ється,  як  в  огнi,
    I  вид  пречистоï  надiï
    Стоïть  у  синiй  глибинi.

    Клянусь  тобi,  веселий  свiте,
    Клянусь  тобi,  моє  дитя,
    Що  буду  жити,  поки  жити
    Менi  дозволить  дух  життя!

    Ходiм!  Шумлять  щасливi  води,
    I  грає  вiтер  навкруги,
    I  голуби  ясноï  вроди
    Черкають  неба  береги.",
    "Має крилами Весна
    Запашна,
    Лине вся в прозорих шатах,
    У серпанках і блаватах...
    Сяє усміхом примар
    З-поза хмар,
    Попелястих, пелехатих.

    Ось вона вже крізь блакить
    Майорить,
    Довгожданна, нездоланна...
    Ось вона — Блакитна Панна!..
    Гори, гай, луги, поля —
    Вся земля
    Їй виспівує: «Осанна!»

    А вона, як мрія сну
    Чарівна,
    Сяє вродою святою,
    Неземною чистотою,
    Сміючись на пелюстках,
    На квітках
    Променистою росою.

    І уже в душі моїй
    В сяйві мрій
    В’ються хмелем арабески,
    Миготять камеї, фрески,
    Гомонять-бринять пісні
    Голосні
    І сплітаються в гротески.",
            );

my @author = (
    "Богдан-Ігор Антонич",
    "Володимир Сосюра",
    "Максим Рильський",
    "Микола Вороний",
             );

#-------------------------------------------------- Пошла Программа ------------------------------
#-------------------------------------------------- Начало. Приветствие + запрос имени ------------------------------
print "Як Вас звати? \n";
chomp(my $name = <STDIN>);
print "Привіт,$name! Якщо ти вирішив перевірити свої знання Укр.літ., то давай почнемо. У тебе буде 12 спроб на те щоб довести, що ти справжній українець. \n".
"Тобі буде надано 12 віршів і ти повинен вказати автора. \n" .
"Почнемо!!! \n";
#-------------------------------------------------- Стандартные значения номера стиха и количества балов ------------------------------
my $number_of_lyrics = 1;
my $score = 0;
#-------------------------------------------------- Цыкл отсчитывающий 12 вопросов ------------------------------
while ($number_of_lyrics <= 12) {
#-------------------------------------------------- Вывод на экран случайного стиха ------------------------------
    my $x = int(rand(4));
    print $lyrics[$x] . "\n" . "\n" . "Виберіть автора Лірики. \n" . "\n";
#-------------------------------------------------- Подготовка в выводу авторов ------------------------------
#-------------------------------------------------- Массив ответов ------------------------------
    my @answers = ($author[int(rand(4))], $author[int(rand(4))], $author[int(rand(4))], $author[int(rand(4))]);
#-------------------------------------------------- Проверка есть ли правильный ответ в ответах ------------------------------
    if (($answers[0] && $answers[1] && $answers[2] && $answers[3]) ne $author[$x]){
        $answers[int(rand(4))] = $author[$x];
    };
#-------------------------------------------------- Убираем повторы в ответах ------------------------------
my %cnt; # будет содержать число повторений элементов
@answers = grep { ! $cnt{$_}++; } @answers;
my $count = (keys %cnt);
while ($count != 4) {
    unshift (@answers, $author[int(rand(4))]);
    my %cnt; # будет содержать число повторений элементов
    @answers = grep { ! $cnt{$_}++; } @answers;
    $count = (keys %cnt);
};
#-------------------------------------------------- Вывод на экран список авторов ------------------------------    
    foreach (@answers) {
        print $_ . "\n";
    };
#-------------------------------------------------- Ввод ответа ------------------------------    
    print "\n" . "Впишіть ім’я автора. \n";
    chomp(my $your_answer = <STDIN>);
#-------------------------------------------------- Проверка на правильность ответа ------------------------------
    if ($your_answer eq $author[$x]) {
        $score += 1;
        print "Ви правильно вказали автора. +1 бал. У Вас $score балів. \n";
        sleep 5;
    } else {
        print "Нажаль Ви помилились і не заробили жодного бала. \n";
        sleep 5;
    }
#-------------------------------------------------- +1 к отсчету конца цыкла ------------------------------
    $number_of_lyrics += 1;
};
#-------------------------------------------------- Конец программыб вывод набраных балов ------------------------------
print "$name, Ви отримали $score балів за цей тест =) \n";